Autodesk.Revit.DB.IFC.IFCExtrusionBasis
This enumerated type represents the possible bases for derivation of extrusion geometry.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionBasis.BasisZ
The Z direction.

Autodesk.Revit.DB.IFC.IFCExtrusionBasis.BasisY
The Y direction.

Autodesk.Revit.DB.IFC.IFCExtrusionBasis.BasisX
The X direction.

Autodesk.Revit.DB.IFC.IFCExtrusionBasis.InvalidBasis
An invalid basis (typically indicating that the extrusion extraction was unsuccessful).